---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenGeometryOnly
source: html/1ebe908e-59e6-15ba-39ac-1ff9cdcf1ea0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenGeometryOnly Property

Mass contains only mesh geometry, which can't be used to compute Mass Floors, volume, or surface area.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenGeometryOnly { get; }
```